In [1]:
import pandas as pd
import numpy as np

In [2]:
school={'Name':['Sam','Jacob',
                'Smith','Ben',
                'Jaden','Keir',
                'Barron','Jeff',
                'James','Michael','Kingston'],
       'Roll_No.':[9,5,
                   3,2,
                   5,1,
                   7,8,
                   3,6,4],
       'Homework':pd.Series(['Done',np.nan,
                             'Not Done','Done',
                            np.nan,'Not Done',
                            'Not Done',np.nan,
                            'Done',np.nan,'Not Done']),
       'Today_Attendance':pd.Series(['Absent','Present',
                                     'Present','Present',
                                    'Absent','Absent',
                                     'Present','Absent',
                                     'Present','Absent','Absent']),
       'Days_of_Absent':[2,1,np.nan,4,8,1,9,5,7,4,6],
       'Marks':[50,40,65,23,19,84,75,9,13,34,5]}
df=pd.DataFrame(school)
df

        Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
0        Sam         9      Done           Absent             2.0     50
1      Jacob         5       NaN          Present             1.0     40
2      Smith         3  Not Done          Present             NaN     65
3        Ben         2      Done          Present             4.0     23
4      Jaden         5       NaN           Absent             8.0     19
5       Keir         1  Not Done           Absent             1.0     84
6     Barron         7  Not Done          Present             9.0     75
7       Jeff         8       NaN           Absent             5.0      9
8      James         3      Done          Present             7.0     13
9    Michael         6       NaN           Absent             4.0     34
10  Kingston         4  Not Done           Absent             6.0      5

In [3]:
df.head(5)

    Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
0    Sam         9      Done           Absent             2.0     50
1  Jacob         5       NaN          Present             1.0     40
2  Smith         3  Not Done          Present             NaN     65
3    Ben         2      Done          Present             4.0     23
4  Jaden         5       NaN           Absent             8.0     19

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Name              11 non-null     object
 1   Roll_No.          11 non-null     int64
 2   Homework          7 non-null      object
 3   Today_Attendance  11 non-null     object
 4   Days_of_Absent    10 non-null     float64
 5   Marks             11 non-null     int64
dtypes: float64(1), int64(2), object(3)
memory usage: 660.0+ bytes

# Sample

### It gives random data from large data set or dataframe.

In [5]:
df.sample(3)

    Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
1  Jacob         5       NaN          Present             1.0     40
2  Smith         3  Not Done          Present             NaN     65
7   Jeff         8       NaN           Absent             5.0      9

# Filtering

### It means to give data as per some criteria or conditions applied on values of column.

In [6]:
df[df['Today_Attendance']=='Present']

     Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
1   Jacob         5       NaN          Present             1.0     40
2   Smith         3  Not Done          Present             NaN     65
3     Ben         2      Done          Present             4.0     23
6  Barron         7  Not Done          Present             9.0     75
8   James         3      Done          Present             7.0     13

In [7]:
df[(df['Today_Attendance']=='Absent') & 
    (df['Homework']=='Not Done')]

        Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
5       Keir         1  Not Done           Absent             1.0     84
10  Kingston         4  Not Done           Absent             6.0      5

In [8]:
df[(df['Today_Attendance']=='Present') & 
    (df['Homework']=='Done') & 
    (df['Marks']<50)]

    Name  Roll_No. Homework Today_Attendance  Days_of_Absent  Marks
3    Ben         2     Done          Present             4.0     23
8  James         3     Done          Present             7.0     13

In [9]:
df[0:3]

    Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
0    Sam         9      Done           Absent             2.0     50
1  Jacob         5       NaN          Present             1.0     40
2  Smith         3  Not Done          Present             NaN     65

In [10]:
df.loc['0','Name']=-1

In [11]:
df[-3:]

        Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
9    Michael       6.0       NaN           Absent             4.0   34.0
10  Kingston       4.0  Not Done           Absent             6.0    5.0
0         -1       NaN       NaN              NaN             NaN    NaN

In [12]:
df.loc[0:2,'Name':'Homework']

    Name  Roll_No.  Homework
0    Sam       9.0      Done
1  Jacob       5.0       NaN
2  Smith       3.0  Not Done

In [13]:
df[0:3]

    Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
0    Sam       9.0      Done           Absent             2.0   50.0
1  Jacob       5.0       NaN          Present             1.0   40.0
2  Smith       3.0  Not Done          Present             NaN   65.0

In [42]:
ss=pd.read_excel(r'C:\Users\hp\OneDrive\Desktop\Sample - Superstore.xlsx')
ss[0:3]

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-08-11 00:00:00,2016-11-11 00:00:00,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2016-152156,2016-08-11 00:00:00,2016-11-11 00:00:00,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820
2,3,CA-2016-138688,2016-12-06 00:00:00,6/16/2016,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.62,2,0.0,6.8714

In [43]:
ss.columns

Index(['Row ID', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Postal Code', 'Region', 'Product ID', 'Category', 'Sub-Category',
       'Product Name', 'Sales', 'Quantity', 'Discount', 'Profit'],
      dtype='object')

In [46]:
ss[ss['Region']=='South'].head(2)

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2016-152156,2016-08-11 00:00:00,2016-11-11 00:00:00,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,0.0,41.9136
1,2,CA-2016-152156,2016-08-11 00:00:00,2016-11-11 00:00:00,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,0.0,219.5820

In [47]:
ss[(ss['Region']=='West')
    &
(ss['Category']=='Furniture')][0:3]

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
5,6,CA-2014-115812,2014-09-06 00:00:00,6/14/2014,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,Los Angeles,...,90032,West,FUR-FU-10001487,Furniture,Furnishings,Eldon Expressions Wood and Plastic Desk Access...,48.860,7,0.0,14.1694
10,11,CA-2014-115812,2014-09-06 00:00:00,6/14/2014,Standard Class,BH-11710,Brosina Hoffman,Consumer,United States,Los Angeles,...,90032,West,FUR-TA-10001539,Furniture,Tables,Chromcraft Rectangular Conference Tables,1706.184,9,0.2,85.3092
24,25,CA-2015-106320,9/25/2015,9/30/2015,Standard Class,EB-13870,Emily Burns,Consumer,United States,Orem,...,84057,West,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,1044.630,3,0.0,240.2649

In [48]:
ss[(ss['Region']=='East') & 
    (ss['Category']=='Furniture') & 
    (ss['Sub-Category']=='Tables')][['Region','Category','Sub-Category']]

     Region   Category Sub-Category
377    East  Furniture       Tables
453    East  Furniture       Tables
728    East  Furniture       Tables
949    East  Furniture       Tables
1002   East  Furniture       Tables
...     ...        ...          ...
9402   East  Furniture       Tables
9467   East  Furniture       Tables
9486   East  Furniture       Tables
9603   East  Furniture       Tables
9899   East  Furniture       Tables

[80 rows x 3 columns]

# Sorting

## Sorting is the process of arranging items or data in a specific order, such as alphabetically, numerically, and ordering data in sequence like ascending and descending.

In [14]:
df[['Name','Marks']].sort_values(by='Marks')

        Name  Marks
10  Kingston    5.0
7       Jeff    9.0
8      James   13.0
4      Jaden   19.0
3        Ben   23.0
9    Michael   34.0
1      Jacob   40.0
0        Sam   50.0
2      Smith   65.0
6     Barron   75.0
5       Keir   84.0
0         -1    NaN

In [16]:
df[['Name','Marks']].sort_values(by='Marks',ascending=True)[0:4]

        Name  Marks
10  Kingston    5.0
7       Jeff    9.0
8      James   13.0
4      Jaden   19.0

In [41]:
df[['Name','Marks']].sort_values(by='Marks',ascending=False)[0:4]

     Name  Marks
5    Keir   84.0
6  Barron   75.0
2   Smith   65.0
0     Sam   50.0

# Transpose

## It means that the original row labels become the new column headers, and the original column headers become the new row labels (index).

In [17]:
df.T

,0,1,2,3,4,5,6,7,8,9,10,0
Name,Sam,Jacob,Smith,Ben,Jaden,Keir,Barron,Jeff,James,Michael,Kingston,-1
Roll_No.,9.0,5.0,3.0,2.0,5.0,1.0,7.0,8.0,3.0,6.0,4.0,NaN
Homework,Done,NaN,Not Done,Done,NaN,Not Done,Not Done,NaN,Done,NaN,Not Done,NaN
Today_Attendance,Absent,Present,Present,Present,Absent,Absent,Present,Absent,Present,Absent,Absent,NaN
Days_of_Absent,2.0,1.0,NaN,4.0,8.0,1.0,9.0,5.0,7.0,4.0,6.0,NaN
Marks,50.0,40.0,65.0,23.0,19.0,84.0,75.0,9.0,13.0,34.0,5.0,NaN

# Loc()

## It has used for indexing and selection of data within a dataframe. It allows you to access and manipulate rows and columns based on their labels rather than their integer position.

In [23]:
ss.loc[2:5,'Region':'Category']

  Region       Product ID         Category
2   West  OFF-LA-10000240  Office Supplies
3  South  FUR-TA-10000577        Furniture
4  South  OFF-ST-10000760  Office Supplies
5   West  FUR-FU-10001487        Furniture

# Query

## The query method in pandas allows for querying Data with string datatype.

In [24]:
df.query('Marks >40')

     Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
0     Sam       9.0      Done           Absent             2.0   50.0
2   Smith       3.0  Not Done          Present             NaN   65.0
5    Keir       1.0  Not Done           Absent             1.0   84.0
6  Barron       7.0  Not Done          Present             9.0   75.0

In [25]:
df.query('Marks >20 and Marks <40')

      Name  Roll_No. Homework Today_Attendance  Days_of_Absent  Marks
3      Ben       2.0     Done          Present             4.0   23.0
9  Michael       6.0      NaN           Absent             4.0   34.0

In [26]:
df.filter(items=['Name','Marks'])

        Name  Marks
0        Sam   50.0
1      Jacob   40.0
2      Smith   65.0
3        Ben   23.0
4      Jaden   19.0
5       Keir   84.0
6     Barron   75.0
7       Jeff    9.0
8      James   13.0
9    Michael   34.0
10  Kingston    5.0
0         -1    NaN

In [27]:
df.filter(like='H',axis=1)

    Homework
0       Done
1        NaN
2   Not Done
3       Done
4        NaN
5   Not Done
6   Not Done
7        NaN
8       Done
9        NaN
10  Not Done
0        NaN

In [30]:
df[df['Marks'].between(40,70)]

    Name  Roll_No.  Homework Today_Attendance  Days_of_Absent  Marks
0    Sam       9.0      Done           Absent             2.0   50.0
1  Jacob       5.0       NaN          Present             1.0   40.0
2  Smith       3.0  Not Done          Present             NaN   65.0

In [38]:
ss[ss['Sales'].between(200,400)]['Sales'][-5:]

9973    271.960
9976    249.584
9988    206.100
9991    258.576
9993    243.160
Name: Sales, dtype: float64